{
  "backend/main.mo": "Motoko actor defining a FormEntry type and Map-based storage with submitEntry function for creating contact form entries (with validation) and getAllEntries query to retrieve all entries in reverse chronological order.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: updating HTML title, replacing hero headline/tagline, integrating the A B Digital Craft logo, and updating footer copyright to 'A B Digital Craft'.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 11 frontend files describing the digital marketing website structure, components (Hero, Services, Portfolio, Testimonials, ContactForm, Footer), hooks, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base layer defining OKLCH color system CSS variables for light and dark modes, including background, foreground, primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'A B Digital Craft', root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React application component rendering the full page layout with Hero, Services, Portfolio, Testimonials, ContactForm, and Footer components in sequence.",
  "frontend/src/components/ContactForm.tsx": "Contact form component using react-hook-form for validation, shadcn/ui components for UI, service dropdown selection, backend integration via useSubmitEntry hook, and success state display with auto-reset.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright for 'A B Digital Craft' with dynamic year, heart icon, and caffeine.ai attribution link with UTM parameters based on hostname.",
  "frontend/src/components/Hero.tsx": "Hero section with background image and gradient overlay, A B Digital Craft logo, headline with 'Your Success Digital Partner' tagline, description text, and CTA button that scrolls to contact form.",
  "frontend/src/components/Portfolio.tsx": "Portfolio section displaying four case study cards in a two-column grid, each with client name, description, measurable results with icons, and service tags using shadcn/ui Card and Badge components.",
  "frontend/src/components/Services.tsx": "Displays a grid of six marketing service cards (SEO, Social Media, Content, PPC, Email, Analytics) with icons, titles, and descriptions. Each card has hover effects including shadow, translation, and border color changes.",
  "frontend/src/components/Testimonials.tsx": "Renders a grid of six client testimonials with quotes, avatars, names, roles, and companies. Each testimonial card includes hover effects and uses gradient-colored avatar fallbacks.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for ICP integration, managing login state, identity persistence, and AuthClient lifecycle. Exports useInternetIdentity hook and InternetIdentityProvider component for authentication flow.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for form submission (useSubmitEntry) and fetching all entries (useGetAllEntries) using the backend actor. Handles query invalidation and actor initialization checks.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space. Includes brand colors (coral, amber, teal) and semantic color tokens for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication. Renders the main App component.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom colors using OKLCH variables, brand colors, custom font families (Inter, Outfit), border radius utilities, and shadow definitions. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a digital marketing website for 'A B Digital Craft' with hero section, services, portfolio, testimonials, and contact form. Contains feature tracking, requirements mapping, and image requirements for the company logo."
}